<template>
    <div class="container">
        <Toper :toperParams="toperParams" />
        <SubToper />
        <div class="about-container">
            <div class="side-container">
                <strong>关于我们</strong>
                <div class="side-list">
                    <nuxt-link v-for="(item, key, index) of SideList" :key="index" :to="'/about/' + key" :class="{ current: key == CurrentSideKey }">{{ item }}</nuxt-link>
                </div>
            </div>
            <div class="main-container">
                <div class="title">{{ CurrentSide }}</div>
                <div class="content-container">
                    <template v-if="CurrentSideKey == 'us'">
                        <div class="content">
                            <p>麦咭TV网（maijtv.com）是金鹰卡通官方网站，与亲子视频流媒体APP“麦咭TV”、动漫APP“麦咭漫画”、麦咭麦咭网共同形成金鹰卡通亲子内容领域的新媒体生态。麦咭TV网以亲子节目、动漫卡通为核心，拥有萌宝视频、麦粉学堂、麦咭商城等多个特色版块，不仅涵盖金鹰卡通王牌节目、热门动画片、各类知识教育内容，还提供节目互动、亲子视频拍摄、主题活动、周边产品购物等丰富的互动体验。</p>
                            <p>麦咭TV，是由湖南广播影视集团金鹰卡通卫视重磅推出的亲子视频流媒体平台。麦咭TV精准定位4-14岁亲子家庭为传播人群，以亲子节目、动漫视频为核心，并建立短视频、教育、购物等多个亲子频道。麦咭TV在儿童应用领域快速抢占市场，致力于打造第一亲子视频流媒体平台。</p>
                            <p>麦咭漫画是全国第一家由电视媒体创办的互联网动漫发布平台。区别于同类平台，麦咭漫画是一个免费平台，且侧重对内容，尤其是作家的宣传和推广，为有潜力的经授权的关注度较高的作者和内容提供宣传推广，使得作家和内容兼具影响力。</p>
                            <p>麦咭麦咭网主要提供漫画发布、动漫互动、产品动态、以及金鹰卡通卫视的节目宣传等。其中有部分漫画文件来源于互联网，版权归属其版权拥有者全权所有，本站仅提供低品质漫画供漫画爱好者免费试看、研究、学习，请勿用于商业用途，否则触犯版权条例后果自负。版权拥有者如果对本站提供的部分漫画有任何疑问或要求删除，请用Email：airtv@qq.com联系我们。</p>
                        </div>
                    </template>
                    <template v-if="CurrentSideKey == 'contact'">
                        <div class="content">
                            <p>
                                <strong>互联网广告商务合作</strong>
                            </p>
                            <p>电话：17607311775</p>
                            <p>邮箱：airtv@qq.com</p>
                            <p>
                                <br />
                            </p>
                            <p>
                                <strong>平台作品内容合作（含动漫亲子教育内容）</strong>
                            </p>
                            <p>QQ ：490753552</p>
                            <p>邮箱：490753552@qq.com</p>
                            <p>
                                <br />
                            </p>
                            <p>
                                <strong>麦咭智能机器人等周边产品合作</strong>
                            </p>
                            <p>电话：4001681008</p>
                            <p>QQ ：2591151802</p>
                            <p>邮箱：2591151802@qq.com</p>
                            <p>
                                <br />
                            </p>
                            <p>
                                <strong>网站BUG问题提交、帐号问题请联系</strong>
                            </p>
                            <p>邮箱：maijicn@qq.com</p>
                            <p></p>
                            <p>
                                <strong>网站不合适内容举报、使用问题及建议请联系</strong>
                            </p>
                            <p>邮箱：maijicn@qq.com</p>
                            <p>
                                <br />
                            </p>
                            <p>电话：17607311775（麦咭TV网经纪专线）</p>
                            <p>地址：湖南省长沙市开福区省广电中心金鹰大厦附10楼</p>
                        </div>
                    </template>
                    <template v-if="CurrentSideKey == 'feedback'">
                        <div class="form">
                            <form v-on:submit="SubmitFeedback">
                                <span>请在这里留下您的意见和建议</span>
                                <textarea name="content" v-model="FeedbackContent"></textarea>
                                <button type="submit">提交</button>
                            </form>
                        </div>
                    </template>
                    <template v-if="CurrentSideKey == 'declaration'">
                        <div class="content">
                            <p>麦咭TV网（maijitv.com）按照下列条款与条件在本网站上提供信息和产品。访问本网站即表示您同意这些条款与条件。麦咭TV网保留无需通知即可随时根据具体情况自行更改这些条款和条件，以及本网站所提及的产品、服务、价格与程序的权利。若违反下列条款与条件，则麦咭TV网保留诸法律寻求补偿的权利。麦咭TV网保留一切未在此明示授予的权利。</p>

                            <p>
                                <strong>适用法律</strong>
                            </p>
                            <p>您同意所有与您访问或使用本网站有关的事务均受中华人民共和国法律管辖。您同意麦咭TV网所在地法院享有上述相关事务的专属管辖权。</p>

                            <p>
                                <strong>版权和商标</strong>
                            </p>
                            <p>本网站包含之所有内容：文字报导、图片、声音、录像、图表、标志、标识、广告、商标、商号、域名、软件、程序、版面设计、专栏目录与名称、内容分类标准以及为注册用户提供的任何或所有信息等之所有权归属麦咭TV网及网站内容/信息提供者，受中国及国际版权法的保护。对本网站上所有内容之复制（意指收集、组合和重新组合），本网站享有排他权并受中国及国际版权法的保护。本网站使用的所有软件的所有权归属于麦咭TV网或它的软件供应商并受中国及国际版权法的保护，严格禁止对本网站该等内容的任何其他使用（包括但不限于再造、重构、修改、发布、转发、再版、演示或播出）。</p>

                            <p>
                                <strong>网站使用</strong>
                            </p>
                            <p>未经麦咭TV网书面许可，任何商业性网站不得建立与本网站及其内容的链接。未经本网站所有者的授权，任何人不得建立本网站的镜像（包括全部和局部镜像）。</p>
                            <p>任何组织和个人不得非法复制、抄袭，或为任何未经允许的商业目的使用本网站及其内容。如果本网站所有者确定用户行为违法或有损网站利益，则将保留采取相关法律行为的权利。</p>
                            <p>本网站布局、页面设计等组成元素受相关法律的保护，不得模仿或复制全部或部分内容。</p>

                            <p>
                                <strong>评论</strong>
                            </p>
                            <p>本网站允许访问客户将其对产品的评论在本网站上发表个性化意见。如果您在本网站上发表评论，您即授权本网站和麦咭TV网在世界范围内的任何媒体上享有非排他、永久、不可更改及完全的许可权利去删除、使用、重新加工、修改、采用、出版、翻译、派生、分发及播出该评论。您同时授权本网站和麦咭TV网的授权使用者使用您的评论并引用您发表评论时的署名。</p>

                            <p>
                                <strong>链接</strong>
                            </p>
                            <p>麦咭TV网或网站的内容/信息提供者若提供了与第三方网站的链接，这些网站不在麦咭TV网的控制范围内。麦咭TV网不能代表第三方网站，包含这样的链接并不暗示麦咭TV网认可、建议或接受对此类网站的内容负有任何责任。当您访问非麦咭TV网网站时，风险由您自行承担。麦咭TV网对第三方网站上的任何数据、意见、建议与陈述的可靠性，不承担任何责任。</p>

                            <p>
                                <strong>版权投诉</strong>
                            </p>
                            <p>麦咭TV网和本网站尊重他人之知识产权。如果您确认您的作品在本网站以某种方式被抄袭，并且该行为触犯了中国及国际版权法的，请向本网站做版权投诉并提供相关证明文件及理由。</p>

                            <p>
                                <strong>免责</strong>
                            </p>
                            <p>除本网站注明之服务条款外：麦咭TV网对本网站上所有内容（包括但不限于本网站上的信息、内容、材料或产品）的合法性、准确性、真实性、实用性和安全性，不提供任何形式的保证，亦不承担任何法律责任。</p>
                        </div>
                    </template>
                    <template v-if="CurrentSideKey == 'agreement'">
                        <div class="content">
                            <p>
                                <strong>提示条款：</strong>
                            </p>
                            <p>
                                <strong>尊敬的用户（以下亦称“您”），欢迎您与我方平台经营者（详见定义条款）共同签署本《用户服务协议》（下称“本协议”）并使用我方平台服务！</strong>
                            </p>
                            <p>请您仔细阅读本协议全部内容，如您不同意本服务条款任意内容，您应立即停止注册程序。如您通过进入注册程序并勾选本协议前选项框，将视为您签署了本协议，表明您自愿接受本协议全部条款的约束。如果您未申请注册流程，或者在本协议生效前已成为我方平台的注册用户，则您通过访问和/或使用我方平台时，会收到本协议签署提示，如果您在收到本协议签署提示并选择确认后，表明您自愿接受本协议全部条款的约束。否则请您不要访问或使用我方平台。</p>
                            <p>由于互联网高速发展，本协议列明的条款并不能完整罗列并覆盖您与我方平台经营者所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。我方平台经营者有权利对本协议进行修改，协议修改后，我方平台会通过系统提示、系统推送等形式，通知您注意及确认协议变更。如果您不同意本协议的修改，请立即停止访问或使用本网站或取消已经获得的服务；如果您在收到系统提示协议变更并选择确认后，则视为您已接受本协议的修改。如您对协议有任何疑问，可向我方平台客服咨询。</p>
                            <p>
                                <strong>第一条 定义</strong>
                            </p>
                            <p>我方平台：指由金鹰卡通运营的麦咭TV移动端各版本、麦咭漫画（域名 maijimanhua.com）及移动端各版本、金鹰卡通官方网站、麦咭手表及其他可穿戴设备等智能接收终端等。我方平台经营者：我方平台经营者为湖南金鹰卡通传媒有限公司。我方平台服务：我方基于互联网，以包含我方平台网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。同一用户：使用同一身份认证信息或经我方平台排查认定多个用户账户的实际控制人为同一人的，均视为同一用户。</p>
                            <p>
                                <strong>第二条 协议范围</strong>
                            </p>
                            <p>本协议由您与我方平台经营者共同缔结，本协议对您与我方平台经营者均具有合同效力。本协议项下，我方平台经营者可能根据我方平台的业务调整而发生变更，变更后的我方平台经营者与您共同履行本协议并向您提供服务，我方平台经营者的变更不会影响您本协议项下的权益。我方平台经营者还有可能因为提供新的我方平台服务而新增，如您使用新增的我方平台服务的，视为您同意新增的我方平台经营者与您共同履行本协议。</p>
                            <p>
                                <strong>第三条【账户注册与使用】</strong>
                            </p>
                            <p>
                                <strong>3.1 用户资格</strong>
                            </p>
                            <p>在您开始使用/注册程序使用我方平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，我方确认后可要求您的监护人追认本协议的效力或终止向您继续提供服务。您因使用我方平台引起的一切法律后果由您及您的监护人负责，我方将依法追究您及您监护人的法律责任。</p>
                            <p>
                                <strong>3.2 账户说明</strong>
                            </p>
                            <p>当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得我方平台账户并成为我方平台用户。您有权使用您设置或确认的我方会员名、邮箱、手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录我方平台。由于用户账户关联用户信息，仅当有法律明文规定、司法裁定或经我方同意，并符合我方平台规则规定的用户账户转让流程的情况下，您才可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此外，您的账户不得以任何方式转让，否则由此产生的一切责任均由您承担。为使您更好地使用我方平台的各项服务，我方建议您按照我方平台要求及相关法律规定完成实名认证。</p>
                            <p>
                                <strong>3.3 不活跃账户回收</strong>
                            </p>
                            <p>如您的账户长期未登录，我方有权予以进行注销等清理，您的账户将不能再登录我方平台，相应服务同时终止。我方在对此类账户进行清理前，将以包括但不限于网站公告、站内消息、客户端推送信息等方式通知您。</p>
                            <p>
                                <strong>3.4 注册信息管理</strong>
                            </p>
                            <p>
                                在使用我方平台服务时，您应当按我方平台页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），以便我方在必要时与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。您所设置的账户名不得违反国家法律法规及我方平台规则关于账户名的管理规定，否则我方可对您的账户名进行暂停使用或注销等处理。您理解并承诺，您的账户名称、头像和简介等注册信息中不得出现违法和不良信息，没有冒用、关联机构或社会名人，您在账户注册过程中需遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等基本要求。您同意并授权，为了更好的为您提供服务以及确保您的账户安全，我方可以根据您提供的手机号码、身份证号码等信息，向全国公民身份号码查询服务中心、电信运营商、金融服务机构等可靠单位发起用户身份真实性、用户征信记录、用户手机号码有效性状态等情况的查询。您应当及时更新您提供的信息，在法律有明确规定要求我方对部分用户的信息进行核实的情况下，我方将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。如我方按您最后一次提供的信息与您联系未果、您未按照我方的要求及时提供信息、您提供的信息不准确，不真实，不详尽，不合法的，您将承担因此对您自身、他人及我方造成的全部损失与不利后果。
                            </p>
                            <p>
                                <strong>3.5 账户安全规范</strong>
                            </p>
                            <p>您的账户为您自行设置并由您保管。建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开我方平台。账户因您主动泄露或遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。您的账户只限您本人使用，不得出借或分享他人使用。当您的账户遭到未经授权的使用时，您应当立即通知我方平台，否则未经授权的使用行为均视为您本人的行为，您将自行承担所有由此导致的损失及后果。除我方存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、发表言论、购买商品及服务及披露信息等）负责。如发现任何未经授权使用您账户登录我方平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知我方。您理解我方对您的任何请求采取行动均需要合理时间，除我方存在过错外，我方对在采取行动前已经产生的后果不承担任何责任。</p>
                            <p>
                                <strong>第四条 我方平台服务及规范</strong>
                            </p>
                            <p>
                                <strong>4.1 我方平台服务</strong>
                            </p>
                            <p>
                                我方平台向您提供包括但不限于以下服务：我方直接拥有或运营的客户端包括但不限于
                                PC、平板、手机、音响、车载、移动可穿戴设备等全部终端的客户端会员服务（付费）（下称“会员服务”）；音频、视频、漫画上传分享服务（下称“内容上传服务”）；直播服务（下称“直播服务”）；搜索服务（下称“搜索服务”）；商城服务（下称“商城服务”）虚拟道具服务（下称“虚拟道具服务”）游戏服务（下称“游戏服务”）麦咭头条、麦咭资讯服务（下称“资讯服务”）我方平台提供的其他技术和或服务（下称“其他技术和服务”）。（以上服务统称为“我方平台服务”）我方平台服务，均仅限于您在我方平台使用，任何以恶意破解等非法手段将我方服务与我方平台分离的行为，均不属于本协议中约定的我方服务。由此引起的一切法律后果由行为人负责，我方将依法追究行为人的法律责任。我方平台网站官方公布的方式为下载、注册、登录、使用我方服务的唯一合法方式，您通过其他任何渠道、任何途径、任何方式获取的我方服务（包括且不限于账户、积分、经验值、积分商品、兑换商品、赠品、下载等）均为非法取得，我方概不承认其效力，且一经发现我方有权立即做出删除、取消、清零、封号等处理，任何因此导致的一切不利后果均由您自行承担。我方保留向相关责任主体追究法律责任的权利。我方有权向您公告（包括但不限于弹出页面、网站公告、站内消息等方式）以修改、替换、升级与我方平台服务相关的任何软件。如果您不同意或者不接受我方平台服务相关软件的修改、替换、升级，请直接拒绝、停止、取消，否则视为您同意并接受我方平台相关软件的修改、替代、升级，同时该同意并接受的行为仍受本协议约束。您理解并认可，您使用我方平台网站或我方平台账户所获得的使用记录、订阅、收藏、积分、经验值、成长值、等级、身份标识、赠券、虚拟积分商品、虚拟兑换商品、虚拟赠品、下载等衍生物，您确认将严格按照我方平台规则进行使用。此处涉及虚拟财产的定性，用户享有何种权利不方便明释。我方平台在法律有明确规定的情况下承担相应的责任。您同意并保证，不得利用我方平台服务或其衍生物（包括但不限于账户、积分、等级、积分商品、活动赠品、下载等服务）进行倒卖、转手、置换、抵押有价交易等方式非法牟利。您不会利用我方平台服务或其衍生物侵犯他人的合法权益，禁止通过网络漏洞、恶意软件或其他非法手段窃取、盗用他人的账户、积分、积分商品等。您理解并认可，如果您通过第三方支付工具在我方平台账户支付或充值后可能产生的任何商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均有可能给您造成相应的经济损失，我方在充分履行其在本协议项下义务和符合法律规定的前提下，不对您的前述风险和损失承担任何责任。
                            </p>
                            <p>
                                <strong>4.2 服务规范</strong>
                            </p>
                            <p>
                                依据我方平台设定之用户权限，您可能通过我方平台服务在我方平台上传、发布或传输相关内容，包括但不限于文字、软件、程序、图形、图片、声音、音乐、音频、链接等信息或其他资料（下称“内容”），但您需对此内容承担相关的法律责任。除双方另有约定外，您使用我方平台服务上传、发布或传输内容即代表了您有权且同意在全世界范围内，永久性的（除非您主动删除或要求我方平台下线上述视频）、免费的授予我方对该内容的存储、使用、发布、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；对您的上传、发布的内容进行商业开发的权利；通过有线或无线网络向您的计算机终端、移动通讯终端（包括但不限于便携式通讯设备如手机和智能平板电脑等）、手持数字影音播放设备、电视接收设备（模拟信号接收设备、数字信号接收设备、数字电视、IPTV、互联网电视、带互联网接入功能的播放设备等）等提供信息的下载、点播、数据传输、移动视频业务（包括但不限于 SMS、MMS、WAP、IVR、Streaming、3G、、4G
                                手机视频等无线服务）、及其相关的宣传和推广等服务的权利；以及再授权给其他第三方以上述方式使用的权利。您理解并知晓在使用我方平台服务时，所接触的内容和信息来源广泛，我方无法对该内容和信息的准确性、真实性、可用性、安全性、完整性和正当性负责。您理解并认可您可能会接触到不正确的、令人不快的、不适当的或令人厌恶的内容和信息，您不会以此追究我方的相关责任。我方不对用户在我方平台上传、发布或传输的任何内容和信息背书、推荐或表达观点，也不对任何内容和信息的错误、瑕疵及产生的损失或损害承担任何责任，您对内容和信息的任何使用需自行承担相关的风险。
                            </p>
                            <p>您同意我方在提供服务的过程中以各种方式投放商业性广告或其他任何类型的商业信息（包括但不限于在我方平台的任何位置上投放广告，在您上传、传播的内容中投放广告），您同意接受我方通过电子邮件、站内短信、手机短信、网站公告或其他方式向您发送促销或其他相关商业信息。您同意在使用我方平台服务过程中，遵守以下法律法规：《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、《中华人民共和国反不正当竞争法》、《中华人民共和国侵权责任法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》等有关计算机及互联网规定的法律、法规。在任何情况下，我方一旦合理地认为您的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向您提供服务。</p>
                            <p>
                                <strong>4.3 禁止的内容</strong>
                            </p>
                            <p>您理解并保证您在我方平台上传、发布或传输的内容（包括您的账户名称等信息）不含有以下内容：（一）反对宪法确定的基本原则的；（二）危害国家统一、主权和领土完整的；（三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；（四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；（五）宣扬邪教、迷信的；（六）扰乱社会秩序，破坏社会稳定的；（七）诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；（八）侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；（九）危害社会公德，损害民族优秀文化传统的；（十）有关法律、行政法规和国家规定禁止的其他内容。如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给我方造成不利后果的，您应负责消除影响，并且赔偿我方因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。</p>
                            <p>
                                <strong>4.4 禁止的行为</strong>
                            </p>
                            <p>
                                您理解并保证不就我方平台服务进行下列的禁止的行为，也不允许任何人利用您的账户进行下列行为：在注册账户时，或使用我方平台服务时，冒充他人，或您讹称与任何人或实体有联系（包括设置失实的账户名称或接入另一用户的账户,伪造标题或以其他方式操控内容），使他人误认为该内容为我方所传输,将无权传输的内容（例如内部资料、机密资料）进行上传、发布、发送电子邮件或以其他方式传输；发送任何未获邀约或未经授权的垃圾电邮、广告或宣传资料，或任何其他商业通讯；未经我方明确许可，使用我方平台服务用于任何商业用途或为任何第三方的利益；跟踪或以其他方式骚扰他人；参与任何非法或有可能非法（由我方判断）的活动或交易，包括传授犯罪方法、出售任何非法药物、洗钱活动、诈骗等；赌博、提供赌博数据或透过任何方法诱使他人参与赌博活动；使用或利用我方知识产权（包括我们的商标、品牌、标志、任何其他专有数据或任何网页的布局或设计），或在其他方面侵犯我方任何知识产权（包括试图对我方平台客户端或所使用的软件进行逆向工程）；通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入我方平台服务、收集或处理通过我方平台服务所提供的内容；参与任何“框架”、“镜像”或其他技术，目的是模仿我方平台服务的外观和功能；干预或试图干预任何用户或任何其他方接入我方平台服务；故意散播病毒、网络蠕虫、特洛伊木马病毒、已损毁的档案或其他恶意代码或项目；未经他人明确同意，分享或发布该等人士可识别个人身份的资料；探究或测试我方平台服务、系统或其他用户的系统是否容易入侵攻击，或在其他方面规避（或试图规避）我方平台服务、系统或其他用户的系统的任何安全功能；对我方平台服务所用的软件进行解编、反向编译或逆向工程，或试图作出上述事项；为破坏或滥用的目的开设多个账户，或恶意上传重复的、无效的大容量数据和信息；故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。
                            </p>
                            <p>
                                <strong>第五条 用户信息保护</strong>
                            </p>
                            <p>
                                我方对保护用户个人信息高度重视，我方将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可我方不会向第三方公开、透露用户个人信息。我方对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全，并将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授权的访问、使用或披露。我方对您的信息承担保密义务，不会出售或出租您的任何信息，我方会在下列情况下才将您的信息与第三方共享：依照法律或司法、行政机关的强制性命令对第三方披露用户个人信息且无需事先向用户发出通知。事先获得您的同意或授权向我方的关联方分享您的个人信息。向可信赖的合作伙伴提供您的个人信息，让他们根据我们的指示并遵循我们的隐私权政策以及其他任何相应的保密和安全措施来为我们处理这些信息。如您是知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷。只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。例如您在我方平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，我方会视情况向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。我方亦非常重视对未成年人个人信息的保护，若您是
                                18 周岁以下的未成年人，在使用我方平台的服务前，应事先取得您的家长或法定监护人的同意。
                            </p>
                            <p>
                                <strong>第六条 第三方链接</strong>
                            </p>
                            <p>我方平台服务可能会包含与其他网站或资源的链接。我方对于前述网站或资源的内容、隐私政策和活动，无权控制、审查或修改，因而也不承担任何责任。</p>
                            <p>
                                <strong>第七条 知识产权</strong>
                            </p>
                            <p>
                                <strong>7.1 知识产权归属</strong>
                            </p>
                            <p>除非另有约定或我方另行声明，我方平台内的所有内容（用户依法享有版权的内容除外）、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利，均归我方或我方关联公司所有。未经我方许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载、修改、出租）。我方平台的Logo、“麦咭TV”“麦咭漫画”等文字、图形及其组合，以及我方平台的其他标识、徵记、产品和服务名称均为我方或我方关联公司在中国或其它国家的商标，未经我方书面授权， 任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。我方对我方专有内容、原创内容和其他通过授权取得的独占或独家内容享有完全知识产权。未经我方许可，任何单位和个人不得私自转载、传播和提供观看服务或者有其他侵犯我方知识产权的行为，否则将承担所有相关的法律责任。</p>
                            <p>
                                <strong>7.2 侵权投诉</strong>
                            </p>
                            <p>
                                根据《中华人民共和国侵权责任法》的规定，任何第三方认为，用户利用我方平台侵害其民事权益或实施侵权行为的，被侵权人有权书面通知我方平台采取删除、屏蔽、断开链接等必要措施。根据《信息网络传播权保护条例》的规定，任何第三方认为，我方平台所涉及的作品、表演、录音录像制品，侵犯自己的合法权益的，可以向我方平台提交书面通知，要求我方平台删除该侵权作品，或者断开链接。通知书应当包含下列内容：权利人的姓名（名称）、联系方式和地址；要求删除或者断开链接的侵权作品、表演、录音录像制品的名称和网络地址；权利人的有效权利证明材料。权利人应当对通知书的真实性负责，如果侵权投诉不实，则需承担相应的法律责任。侵权投诉必须包含下述信息：被侵权人的有效权利证明材料，或被侵权作品的原始链接及其它证明材料；侵权信息或作品在我方平台上的具体名称及链接；侵权投诉人的联络方式，以便我方平台及时与您取得联系，包括电子邮件地址、电话号码或手机等；投诉内容须纳入以下声明：“本人本着诚信原则，有证据认为该对象侵害本人的合法权益。本人承诺全部投诉信息真实、准确，自愿承担一切后果。本人亲笔签字并注明日期，如代理他人投诉的，必须出具授权人签字的授权书。”
                            </p>
                            <p>
                                <strong>第八条 用户的违约及处理</strong>
                            </p>
                            <p>
                                发生如下情形之一的，视为您违约：（一）使用我方平台服务时违反有关法律法规规定的（二）违反本协议或本协议补充协议约定的。由于互联网的特殊性，您理解并同意，我方可在我方平台规则中约定违约认定的程序和标准。如：我方可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。如您在我方平台上发布的内容和信息构成违约的，我方可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、注销等处理。您在我方平台上实施的行为，或虽未在我方平台上实施但对我方平台及其用户产生影响的行为构成违约的，我方可依据相应规则对您的账户执行限制参加活动、中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，我方可查封您的账户，终止向您提供服务。如果您在我方平台上的行为违反相关的法律法规，我方可依法向相关主管机关报告并提交您的使用记录和其他信息。如您的行为使我方及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿我方及/或其关联公司的上述全部损失。如您的行为使我方及/或其关联公司遭受第三人主张权利，我方及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。我方负责"按现状"和"可得到"的状态向您提供我方平台服务。我方依法律规定承担相应义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，黑客活动、计算机病毒、电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。我方通过中华人民共和国境内的设施控制和提供我方平台服务，我方不担保控制或提供的服务在其他国家或地区是适当的、可行的，任何在其他司法辖区使用我方平台服务的用户应自行确保其遵守当地的法律法规，我方对此不承担任何责任。
                            </p>
                            <p>
                                <strong>第九条 通知</strong>
                            </p>
                            <p>您同意我方以以下合理的方式向您送达各类通知：（一）公示的文案；（二）站内消息、弹出消息、客户端推送的消息；（三）根据您预留于我方平台的联系方式发出的电子邮件、手机短信、函件等；（四）其他通过您的账户或联系方式向您发送的消息。</p>
                            <p>
                                <strong>第十条 服务的终止</strong>
                            </p>
                            <p>您可随时根据实际情况中断或终止使用我方平台服务。我方有权在任何时候，基于任何原因，暂时或永久地终止本网站服务之全部或部分，而无需提前通知。我方平台经营者对我方平台服务的终止对用户和任意第三人均无需承担任何责任。我方有权在任何时候，基于任何原因，暂时或永久地终止用户的账号、密码使用本网站服务，或删除、转移用户存储、发布在本网站的内容，而无需提前通知，且对用户和任意第三人均无需承担任何责任。</p>
                            <p>
                                <strong>第十一条 法律适用、管辖与其他</strong>
                            </p>
                            <p>本协议的生效、履行、解释及争议的解决均适用中华人民共和国法律；用户因使用我方平台而产生或与之相关的一切争议。权利主张或其他事项，均适用中华人民共和国法律。您因使用我方平台服务所产生及与我方平台服务有关的争议，由我方与您协商解决。协商不成时，任何一方均可向我方平台经营者所在地有管辖权的人民法院提起诉讼。本协议任意一条被视为废止、无效或不可执行，该条款应视为可分的且不影响本协议其他条款的法律效力。</p>
                            <p>
                                <strong>【审慎提醒】</strong>
                            </p>
                            <p>如您点击“同意”，则本协议将立即生效，并构成您和湖南金鹰卡通传媒有限公司及其经营平台之间有约束力的法律文件。请您再次确认您已全部阅读并充分理解上述协议。</p>
                        </div>
                    </template>
                    <template v-if="CurrentSideKey == 'help'">
                        <div class="content">敬请期待</div>
                    </template>
                </div>
            </div>
        </div>
        <Footer />
    </div>
</template>
<style lang="scss">
.about-container {
    max-width: 1400px;
    margin: 30px auto;
    padding: 0 20px;
    display: flex;
    align-items: flex-start;

    .side-container {
        width: 200px;
        flex-shrink: 0;
        flex-grow: 0;
        border: solid 1px #ccc;
        padding-bottom: 100px;

        strong {
            display: block;
            padding: 10px;
            font-size: 20px;
            font-weight: normal;
            border-bottom: solid 2px rgb(159, 216, 246);
        }
        .side-list {
            padding: 10px;
            a {
                display: block;
                padding: 10px;
                font-size: 14px;
                &:before {
                    content: '▶';
                    color: rgb(159, 216, 246);
                    margin-right: 10px;
                }

                &:hover {
                    color: rgb(255, 120, 70);
                    &:before {
                        color: rgb(255, 120, 70);
                    }
                }
                &.current {
                    background: rgb(0, 160, 232);
                    color: #fff;
                    &:before {
                        color: #fff;
                    }
                }
            }
        }
    }
    .main-container {
        margin-left: 20px;
        border: solid 1px #ccc;
        min-height: 600px;
        width: 100%;
        div.title {
            padding: 10px;
            font-size: 20px;
            font-weight: normal;
            border-bottom: solid 1px #ccc;
            color: rgb(255, 120, 70);
        }
        .content-container {
            padding: 30px;
            .content {
                font-size: 16px;
                line-height: 2em;
                p {
                    text-indent: 2em;
                    text-align: justify;
                    text-justify: inter-ideograph;
                    margin-block-start: 1em;
                    margin-block-end: 1em;
                    margin-inline-start: 0px;
                    margin-inline-end: 0px;
                }
            }
            .form {
                textarea {
                    display: block;
                    border: solid 1px #ccc;
                    width: 600px;
                    height: 200px;
                    margin: 20px 0;
                    padding: 10px;
                    font-size: 14px;
                    font-family: Helvetica, 'Droid Sans', Tahoma, Roboto, 'Microsoft YaHei', 微软雅黑, 'Heiti SC', 'Droid Sans Fallback', 'Hiragino Sans GB', 宋体;
                    line-height: 20px;
                }
                button {
                    background: rgb(0, 160, 232);
                    color: #fff;
                    padding: 10px 30px;
                    font-size: 14px;
                    cursor: pointer;
                }
            }
        }
    }
}
</style>
<script>
import Toper from '~/components/Toper.vue';
import SubToper from '~/components/SubToper.vue';
import Footer from '~/components/Footer.vue';
import axios from 'axios';

export default {
    data() {
        return {
            toperParams: {
                backgroundColor: 'white'
            },
            FeedbackContent: ''
        };
    },
    components: {
        Toper,
        SubToper,
        Footer
    },
    methods: {
        async SubmitFeedback(evt) {
            evt.preventDefault();
            if (!this.FeedbackContent) return false;
            // if (!this.$store.state.session.token) {
            //     alert('请先登录再提交意见');
            //     return false;
            // }
            let result = await axios({
                url: this.$domain + '/urm/addComment',
                method: 'post',
                headers: {
                    // token: this.$store.state.session.token || ''
                },
                data: { comment: this.FeedbackContent }
            });
            if (result.data.msgCd == '00000') {
                alert('您的意见已提交, 感谢您的支持!');
                this.FeedbackContent = '';
            } else {
                alert(result.data.msgInfo);
            }

            return false;
        }
    },
    async asyncData(context) {
        let type = context.params.id;
        let side = {
            us: '关于我们',
            contact: '联系我们',
            feedback: '意见建议',
            declaration: '用户声明',
            agreement: '使用协议',
            help: '使用帮助'
        };
        let result = {};
        result.SideList = side;
        result.CurrentSide = side[type];
        result.CurrentSideKey = type;
        return result;
    }
};
</script>
